Repository: aminfaruq/essential-chess-project
Catalog: EssentialChessApp/EssentialChessApp/Resources/Localizable.xcstrings
Source language: en
Languages: id

source: %@ to Move
id: %@ Melangkah

source: ⏳ Trigger 3-Hour Cooldown
id: ⏳ Picu Waktu Tunggu 3 Jam

source: 🏆 Pass First Exam (Unlock Next Level)
id: 🏆 Lulus Ujian Pertama (Buka Level Berikutnya)

source: 💣 Reset All Progress
id: 💣 Atur Ulang Semua Kemajuan

source: 🚀 Unlock First Exam (Solve 100%)
id: 🚀 Buka Ujian Pertama (Selesaikan 100%)

source: 3 lives · 10 random puzzles
id: 3 nyawa · 10 teka-teki acak

source: A mix of tactical themes to improve your overall vision.
id: Campuran tema taktis untuk meningkatkan visi taktik Anda secara keseluruhan.

source: Achievements
id: Pencapaian

source: Advanced Combinations
id: Kombinasi Lanjutan

source: Advanced Pawn
id: Pion Maju

source: Advanced Tactics
id: Taktik Lanjutan

source: Anastasia's Mate
id: Skakmat Anastasia

source: App Data
id: Data Aplikasi

source: Arabian Mate
id: Skakmat Arab

source: Are you sure you want to reset all your progress?
id: Apakah Anda yakin ingin mengatur ulang semua kemajuan Anda?

source: Assessment Complete
id: Penilaian Selesai

source: Available in %@
id: Tersedia dalam %@

source: Back Rank Mate
id: Skakmat Baris Belakang

source: Back to Curriculum
id: Kembali ke Kurikulum

source: Back to Themes
id: Kembali ke Tema

source: Basic Pawn Endgame
id: Permainan Akhir Pion Dasar

source: Basic Rook Ending
id: Permainan Akhir Benteng Dasar

source: Beginner Foundation
id: Fondasi Pemula

source: Best
id: Terbaik

source: Black
id: Hitam

source: Black to Move
id: Hitam Melangkah

source: Blue
id: Biru

source: Board Theme
id: Tema Papan

source: Brown
id: Cokelat

source: Cancel
id: Batal

source: Checkmates
id: Skakmat

source: Chess Academy
id: Akademi Catur

source: Clearance
id: Pembukaan Ruang

source: Complete all themes to unlock
id: Selesaikan semua tema untuk membuka

source: Complete previous section to unlock
id: Selesaikan bagian sebelumnya untuk membuka

source: Complete the previous exam to unlock this section.
id: Selesaikan ujian sebelumnya untuk membuka bagian ini.

source: Continue
id: Lanjutkan

source: Curriculum
id: Kurikulum

source: Daily Limit Reached
id: Batas Harian Tercapai

source: Daily Practice Reminder
id: Pengingat Latihan Harian

source: Debug Menu
id: Menu Debug

source: Decoy
id: Pancingan

source: Deepen your vision. Apply the exact same tactical motifs in more complex scenarios, requiring longer calculation and fewer obvious clues.
id: Pertajam instingmu. Terapkan motif taktik yang sama di skenario yang lebih rumit. Butuh perhitungan lebih panjang dan minim petunjuk visual.

source: Defensive Rook
id: Benteng Bertahan

source: Deflection
id: Pengalihan

source: Discovered Attack
id: Serangan Tersembunyi

source: Done
id: Selesai

source: Double Check
id: Skak Ganda

source: English
id: Bahasa Inggris

source: Exam Failed
id: Ujian Gagal

source: Exam Passed!
id: Ujian Lulus!

source: Excellent Move!
id: Langkah yang Sangat Bagus!

source: Find the best move
id: Temukan langkah terbaik

source: Find the hidden tactics. The themes remain the same, but you must now uncover them through sacrifices, preliminary moves, and deeper calculation.
id: Temukan taktik tersembunyi. Temanya masih sama, tapi sekarang kamu harus menemukannya lewat pengorbanan perwira, langkah persiapan, dan kalkulasi mendalam.

source: Fork
id: Garpu

source: Fundamental Tactics
id: Taktik Dasar

source: Game Experience
id: Pengalaman Bermain

source: Get it right next time!
id: Coba lagi dengan benar di kesempatan berikutnya!

source: Get reminded every day at 8:00 AM to complete your puzzles and keep your streak alive.
id: Dapatkan pengingat setiap hari pukul 08:00 untuk menyelesaikan teka-teki Anda dan menjaga rentetan kemenangan Anda.

source: Green
id: Hijau

source: Haptic Feedback
id: Getaran

source: Hint
id: Petunjuk

source: Hint (−1 ♥)
id: Petunjuk (−1 ♥)

source: I have experience
id: Saya sudah berpengalaman

source: I'm new to chess
id: Saya baru dalam catur

source: Incorrect Move
id: Langkah Salah

source: Interference
id: Gangguan

source: Intermediate Tactics
id: Taktik Menengah

source: Language
id: Bahasa

source: Learn How to Move
id: Pelajari Cara Melangkah

source: Loading chess board...
id: Memuat papan catur...

source: Loading Puzzles...
id: Memuat Teka-teki...

source: Loading Streak...
id: Memuat Rentetan...

source: Master tactics faster with unlimited puzzles, full curriculum access, and premium themes.
id: Kuasai taktik lebih cepat dengan teka-teki tak terbatas, akses kurikulum penuh, dan tema premium.

source: Master tactics. Unlock your potential.
id: Kuasai taktik. Buka potensi Anda.

source: Master the basics. Recognize essential tactical patterns, checkmates, and endgames in simple, clear positions requiring 1 to 2 moves.
id: Kuasai fondasi dasar. Kenali pola taktik penting, skakmat, dan penyelesaian akhir di posisi sederhana yang bisa diselesaikan dalam 1-2 langkah.

source: Mastery Level
id: Level Master

source: Mate in 1
id: Skakmat Dalam 1 langkah

source: Mate in 2
id: Skakmat Dalam 2 langkah

source: Mate in 3+
id: Skakmat 3 langkah

source: Mix Puzzle Exam
id: Ujian Teka-Teki Campuran

source: Monochrome
id: Monokrom

source: NEW
id: BARU

source: New Record!
id: Rekor Baru

source: Next
id: Lanjut

source: Next Puzzle
id: Teka-teki Selanjutnya

source: No
id: Tidak

source: No puzzles available.
id: Tidak ada teka-teki.

source: Notifications
id: Notifikasi

source: On Cooldown
id: Sedang Mengisi Ulang

source: Passed — section unlocked!
id: Lulus — sesi terbuka!

source: Passed Pawn
id: Pion Bebas

source: Pawn Endgames
id: Permainan Akhir Pion

source: Pawn Promotion
id: Promosi Pion

source: Piece Style
id: Tema Bidak

source: Pin
id: Pakuan

source: Placement Test
id: Tes Penempatan

source: Play Again
id: Main Lagi

source: Play Modes
id: Mode Bermain

source: Preparing your diagnostic test...
id: Mempersiapkan tes diagnostik Anda...

source: Proceed
id: Lanjutkan

source: Puzzle
id: Teka-teki

source: Puzzle %lld
id: Teka-teki %lld

# Puzzle %lld of %lld
source: Puzzle %1$lld of %2$lld
id: Teka-teki %1$lld dari %2$lld

source: Puzzle Sequence
id: Urutan Teka-teki

source: Puzzles
id: Teka-teki

source: Quiet Move
id: Langkah Tenang

source: Race against the clock to solve as many puzzles as possible.
id: Berpacu dengan waktu untuk menyelesaikan teka-teki sebanyak mungkin.

source: Rating Penalty
id: Penalti Peringkat

source: Reset All Progress
id: Atur Ulang Semua Kemajuan

source: Restore Purchases
id: Pulihkan Pembelian

source: Rook & Passed Pawn
id: Benteng & Pion Bebas

source: Rook Endgames
id: Permainan Akhir Benteng

source: Rook Tactics
id: Taktik Benteng

source: Sacrifice Mastery
id: Penguasaan Pengorbanan

source: Score
id: Skor

source: Section Locked
id: Bagian Terkunci

source: Session ended. Final Score: %lld
id: Sesi berakhir. Skor Akhir: %lld

source: Session ended. Final Streak: %lld
id: Sesi berakhir. Rentetan Akhir: %lld

source: Settings
id: Pengaturan

source: Show Hint (Free)
id: Tampilkan Petunjuk (Gratis)

source: Skewer
id: Tusukan

source: Smothered Mate
id: Skakmat Tercekik

source: Solution
id: Solusi

source: Solve as many as you can in 3 minutes
id: Selesaikan sebanyak mungkin dalam 3 menit

source: Solve as many puzzles as you can without making a mistake.
id: Selesaikan sebanyak mungkin teka-teki tanpa melakukan satupun kesalahan.

source: Sound Effects
id: Efek Suara

source: Start from the very beginning
id: Mulai dari awal

source: Start Learning
id: Mulai Belajar

source: Start Storm
id: Mulai Puzzle Storm

source: Start your chess journey. Learn how each piece moves, understand essential board rules, and grasp the absolute fundamentals of safe captures and defense.
id: Langkah awal perjalanan caturmu. Kenali cara jalan setiap bidak, pahami aturan dasar, dan kuasai teknik fundamental untuk bertahan serta menangkap bidak dengan aman.

source: Streak Ended
id: Streak Berakhir

source: Streak Ended!
id: Rentetan Berakhir!

source: Take a 15-puzzle placement test
id: Ikuti tes penempatan 15 teka-teki

source: Terms & Privacy
id: Ketentuan & Privasi

source: The Bishop
id: Gajah

source: The bishop moves any number of squares diagonally in any direction, provided the path is clear. It cannot jump over other pieces and must stay on the same square color for the entire game. To capture, the bishop moves to a square occupied by an opponent's piece and removes it from the board.
id: Gajah bergerak diagonal ke arah manapun sejauh mungkin, asalkan jalurnya tidak terhalang. Gajah tidak dapat melompati buah lain dan harus tetap berada di warna kotak yang sama sepanjang permainan. Untuk memakan, gajah bergerak ke kotak yang ditempati oleh buah lawan dan menyingkirkannya dari papan.

source: The correct move has been highlighted.
id: Langkah yang benar telah disorot.

source: The King
id: Raja

source: The king moves exactly one square in any direction: horizontally, vertically, or diagonally. It is the most important piece but has limited mobility, and it can never move onto a square that is under attack by an enemy piece.
id: Raja bergerak tepat satu kotak ke arah manapun: horizontal, vertikal, atau diagonal. Raja adalah buah yang paling penting namun memiliki pergerakan yang terbatas, dan tidak pernah boleh bergerak ke kotak yang sedang diserang oleh buah lawan.

source: The Knight
id: Kuda

source: The knight moves in an L-shape: two squares in one direction (vertically or horizontally) and then one square perpendicularly. It is the unique piece that can jump over other pieces, and it always lands on a square of the opposite color from its starting position.
id: Kuda bergerak membentuk huruf L: dua kotak dalam satu arah (vertikal atau horizontal) dan kemudian satu kotak secara tegak lurus. Kuda adalah buah unik yang dapat melompati buah lain, dan selalu mendarat di kotak dengan warna yang berlawanan dari posisi awalnya.

source: The Pawn
id: Pion

source: The pawn moves directly forward one square at a time, but on its first move, it can advance two squares if both are vacant. It captures by moving one square diagonally forward to the left or right, and it is the only piece that captures differently than it moves. If a pawn reaches the opposite end of the board, it is promoted to any piece except a king, and it can also perform the special en passant capture.
id: Pion bergerak lurus ke depan satu kotak demi satu kotak, tetapi pada langkah pertamanya, pion dapat maju dua kotak jika keduanya kosong. Pion memakan buah lawan dengan bergerak satu kotak secara diagonal ke depan kiri atau kanan, dan merupakan satu-satunya buah yang cara memakannya berbeda dari cara bergeraknya. Jika pion mencapai ujung papan lawan, pion tersebut akan dipromosikan menjadi buah apa saja selain raja, dan pion juga dapat melakukan gerakan menangkap khusus yang disebut en passant.

source: The Queen
id: Menteri

source: The queen is the most powerful piece in chess, able to move any number of squares horizontally, vertically, or diagonally in a straight line. It combines the movement powers of the rook and the bishop but cannot jump over other pieces. The queen captures an opponent's piece by landing on the square it occupies.
id: Menteri adalah buah paling kuat dalam catur, mampu bergerak sejauh apapun secara horizontal, vertikal, atau diagonal dalam garis lurus. Menteri menggabungkan pergerakan benteng dan gajah, tetapi tidak dapat melompati buah lain. Menteri memakan buah lawan dengan mendarat di kotak yang ditempatinya.

source: The Rook
id: Benteng

source: The rook moves in straight lines, either horizontally along ranks or vertically along files, for any number of unoccupied squares. It cannot jump over other pieces, but it captures an enemy piece by landing on the square it occupies.
id: Benteng bergerak lurus, baik secara horizontal di sepanjang baris maupun vertikal di sepanjang lajur, sejauh kotak kosong yang tersedia. Benteng tidak dapat melompati buah lain, namun dapat memakan buah lawan dengan mendarat di kotak yang ditempati lawan tersebut.

source: Theme Complete!
id: Tema Selesai!

source: This action cannot be undone.
id: Tindakan ini tidak dapat dibatalkan.

source: Time's Up!
id: Waktu Habis!

source: Trapped Piece
id: Perwira Terjebak

source: True mastery. Execute standard tactical patterns hidden within complex variations, deep combinations, and unforgiving endgame positions.
id: Level master sesungguhnya. Eksekusi pola taktik standar yang tersembunyi di balik variasi rumit, kombinasi panjang, dan posisi endgame yang sangat mematikan.

source: Underpromotion
id: Promosi Selain Ratu

source: Unlock Essential Chess Pro
id: Buka Essential Chess Pro

source: Unlock Pro
id: Buka Pro

source: Unrated
id: Belum Dinilai

source: Upgrade to Essential Chess Pro
id: Tingkatkan ke Essential Chess Pro

source: Using a hint or seeing the solution will count this puzzle as incorrect and decrease your rating. Do you want to proceed?
id: Menggunakan petunjuk atau melihat solusi akan menghitung teka-teki ini sebagai salah dan menurunkan peringkat Anda. Apakah Anda ingin melanjutkan?

source: Where do you start?
id: Dari mana Anda memulai?

source: White
id: Putih

source: White to Move
id: Putih Melangkah

source: X-Ray Attack
id: Serangan X-Ray

source: Yes, Reset
id: Ya, Atur Ulang

source: You've completed your 7 free puzzles today. Come back tomorrow or upgrade to Pro to play endlessly.
id: Anda telah menyelesaikan 7 teka-teki gratis hari ini. Kembali besok atau tingkatkan ke Pro untuk bermain tanpa batas.

source: You've run out of lives. Come back in 4 hours.
id: Anda kehabisan nyawa. Kembali dalam 4 jam.

source: You've unlocked the next section.
id: Anda telah membuka bagian berikutnya.

source: You've used your free Puzzle Storm today. Come back tomorrow or upgrade to Pro to play endlessly.
id: Anda telah menggunakan Puzzle Storm gratis Anda hari ini. Kembali besok atau tingkatkan ke Pro untuk bermain tanpa batas.

source: You've used your free Puzzle Streak today. Come back tomorrow or upgrade to Pro to play endlessly.
id: Anda telah menggunakan Puzzle Streak gratis Anda hari ini. Kembali besok atau tingkatkan ke Pro untuk bermain tanpa batas.

source: Your estimated rating
id: Perkiraan peringkat Anda

source: Zwischenzug
id: Langkah Antara
